{"timeLimit":2000,"input":"В первой строке входных данных дана строка~--- текст с сайта. Во второй строке входных данных дана другая строка~--- запрещенное слово. Первая строка состоит из маленьких латинских букв и цифр, вторая строка состоит только из маленьких латинских букв. Длина каждой строки не превышает $100$.\r\n","sampleTests":[{"input":"inah0leinthegroundthereliv3dah0bb1t\r\nhobbit\r\n","output":"YES\r\n"},{"input":"whath4v3igotinmypocket\r\nhandses\r\n","output":"NO\r\n"},{"input":"whath4veig0t1nmyp0ck37\r\nknife\r\n","output":"NO\r\n"},{"input":"wh4thav31go71nmyp0ck3t\r\nstringofnothing\r\n","output":"NO\r\n"}],"legend":"Дети, как известно, все раньше и раньше начинают пользоваться интернетом. Теперь, когда у них возникают вопросы, они не бегут к родителям, а заходят в свою любимую поисковую систему и узнают ответ в интернете. Но вдруг они случайно найдут что-нибудь, что им знать пока рановато? Или, может быть, лучше не знать вообще никогда?\r\n\r\nВ одной стране эту проблему решили очень просто: был создан список запрещенных для использования в интернете слов. Ведь очевидно, что статья, в которой упоминается какое-нибудь нехорошее слово, не может научить ребенка ничему хорошему. Любой сайт, содержащий хотя бы одно слово из этого списка, теперь подлежит мгновенной блокировке. Невинный ребенок никогда не натолкнется на что-нибудь, про что ему еще рановато знать~--- такой статьи просто не найдется в интернете. Но злобные сайтовладельцы придумали способ обойти этот запрет: если вместо некоторых букв написать внешне похожие на них цифры, то прочитать этот текст все равно будет можно, а робот, проверяющий сайты на пригодность, не распознает в слове запрещенное~--- ведь формально его нет на сайте.\r\n\r\nВаша задача~--- помочь правительству этой страны защитить детей от вредной информации. Напишите программу, которая будет проверять, нет ли в данной строке запрещенного слова, учитывая возможное коварство сайтовладельцев. Известно, что сайтовладельцы иногда делают следующие замены: \r\ne $\\Rightarrow$ 3, \r\no $\\Rightarrow$ 0,\r\ni $\\Rightarrow$ 1,\r\nt $\\Rightarrow$ 7,\r\na $\\Rightarrow$ 4,\r\ns $\\Rightarrow$ 5.","outputFile":"stdout","name":"Слова не пройдут","authorName":"Oleg Mingalev","inputFile":"stdin","tutorial":"","language":"russian","notes":"","output":"Выведите <<YES>>, если запрещенное слово встречается как подстрока в строке с сайта, и <<NO>> иначе. Возможно, в строке с сайта некоторые буквы изначально были заменены на цифры в соответствии с приведенными выше правилами. ","authorLogin":"Captain","memoryLimit":67108864}